Revit 2027 API
CableTraySizeIterator.HasCurrent Method
 Identifies if the iterator has a current item.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasCurrent()
Public Function HasCurrent As Boolean
public:
bool HasCurrent()
member HasCurrent : unit -> bool
Return Value
Boolean
 True if there is a current item.
Remarks
 There is no current item if the iterator has not started yet or has been done.
See Also
Reference
CableTraySizeIterator Class
Autodesk.Revit.DB.Electrical Namespace